Revit 2015 API
AnalyticalModel.GetAnalyticalProjectionType Method
 Retrieves Analytical Model projection information for a specific direction. in direction: direction in which the Analytical Model may be projected.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. Analytical Projection has been divided into Projection and Extension. Use one of AnalyticalModelStick.GetProjectionY(), AnalyticalModelStick.GetProjectionZ() methods or AnalyticalModelColumn.BaseExtension, AnalyticalModelColumn.TopExtension, AnalyticalModelSurface.ProjectionZ, AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties instead.")]
public AnalyticalProjectionType GetAnalyticalProjectionType(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. Analytical Projection has been divided into Projection and Extension. Use one of AnalyticalModelStick.GetProjectionY(), AnalyticalModelStick.GetProjectionZ() methods or AnalyticalModelColumn.BaseExtension, AnalyticalModelColumn.TopExtension, AnalyticalModelSurface.ProjectionZ, AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties instead.")> _
Public Function GetAnalyticalProjectionType ( _
	selector As AnalyticalElementSelector, _
	direction As AnalyticalDirection _
) As AnalyticalProjectionType
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. Analytical Projection has been divided into Projection and Extension. Use one of AnalyticalModelStick.GetProjectionY(), AnalyticalModelStick.GetProjectionZ() methods or AnalyticalModelColumn.BaseExtension, AnalyticalModelColumn.TopExtension, AnalyticalModelSurface.ProjectionZ, AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties instead.")]
public:
AnalyticalProjectionType GetAnalyticalProjectionType(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 End of the analytical model.
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction of the analytical model.
Return Value
 Indicates if the projection is a preset value, or refers to a Datum Plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  direction is invalid for analytical model
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace